MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV256GM006/mcu.h
extern volatile RPOR2BITS RPOR2bits __attribute__((__sfr__));

#define RPOR3 RPOR3
extern volatile uint16_t RPOR3 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR3BITS {
  union {
    struct {
      uint16_t RP40R:6;
      uint16_t :2;
      uint16_t RP41R:6;
    };
    struct {
      uint16_t RP40R0:1;
      uint16_t RP40R1:1;
      uint16_t RP40R2:1;
      uint16_t RP40R3:1;
      uint16_t RP40R4:1;
      uint16_t RP40R5:1;
      uint16_t :2;
      uint16_t RP41R0:1;
      uint16_t RP41R1:1;
      uint16_t RP41R2:1;
      uint16_t RP41R3:1;
      uint16_t RP41R4:1;
      uint16_t RP41R5:1;
    };
  };
} RPOR3BITS;
extern volatile RPOR3BITS RPOR3bits __attribute__((__sfr__));

#define RPOR4 RPOR4
extern volatile uint16_t RPOR4 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR4BITS {
  union {
    struct {
      uint16_t RP42R:6;
      uint16_t :2;
      uint16_t RP43R:6;
    };
    struct {
      uint16_t RP42R0:1;
      uint16_t RP42R1:1;
      uint16_t RP42R2:1;
      uint16_t RP42R3:1;
      uint16_t RP42R4:1;
      uint16_t RP42R5:1;
      uint16_t :2;
      uint16_t RP43R0:1;
      uint16_t RP43R1:1;
      uint16_t RP43R2:1;
      uint16_t RP43R3:1;
      uint16_t RP43R4:1;
      uint16_t RP43R5:1;
    };
  };
} RPOR4BITS;
extern volatile RPOR4BITS RPOR4bits __attribute__((__sfr__));

#define RPOR5 RPOR5
extern volatile uint16_t RPOR5 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR5BITS {
  union {
    struct {
      uint16_t RP48R:6;
      uint16_t :2;
      uint16_t RP49R:6;
    };
    struct {
      uint16_t RP48R0:1;
      uint16_t RP48R1:1;
      uint16_t RP48R2:1;
      uint16_t RP48R3:1;
      uint16_t RP48R4:1;
      uint16_t RP48R5:1;
      uint16_t :2;
      uint16_t RP49R0:1;
      uint16_t RP49R1:1;
      uint16_t RP49R2:1;
      uint16_t RP49R3:1;
      uint16_t RP49R4:1;
      uint16_t RP49R5:1;
    };
  };
} RPOR5BITS;
extern volatile RPOR5BITS RPOR5bits __attribute__((__sfr__));

#define RPOR6 RPOR6
extern volatile uint16_t RPOR6 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR6BITS {
  union {
    struct {
      uint16_t RP54R:6;
      uint16_t :2;
      uint16_t RP55R:6;
    };
    struct {
      uint16_t RP54R0:1;
      uint16_t RP54R1:1;
      uint16_t RP54R2:1;
      uint16_t RP54R3:1;
      uint16_t RP54R4:1;
      uint16_t RP54R5:1;
      uint16_t :2;
      uint16_t RP55R0:1;
      uint16_t RP55R1:1;
      uint16_t RP55R2:1;
      uint16_t RP55R3:1;
      uint16_t RP55R4:1;
      uint16_t RP55R5:1;
    };
  };
} RPOR6BITS;
extern volatile RPOR6BITS RPOR6bits __attribute__((__sfr__));

#define RPOR7 RPOR7
extern volatile uint16_t RPOR7 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR7BITS {
  union {
    struct {
      uint16_t RP56R:6;
      uint16_t :2;
      uint16_t RP57R:6;
    };
    struct {
      uint16_t RP56R0:1;
      uint16_t RP56R1:1;
      uint16_t RP56R2:1;
      uint16_t RP56R3:1;
      uint16_t RP56R4:1;
      uint16_t RP56R5:1;
      uint16_t :2;
      uint16_t RP57R0:1;
      uint16_t RP57R1:1;
      uint16_t RP57R2:1;
      uint16_t RP57R3:1;
      uint16_t RP57R4:1;
      uint16_t RP57R5:1;
    };
  };
} RPOR7BITS;
extern volatile RPOR7BITS RPOR7bits __attribute__((__sfr__));

#define RPOR8 RPOR8
extern volatile uint16_t RPOR8 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR8BITS {
  union {
    struct {
      uint16_t RP69R:6;
      uint16_t :2;
      uint16_t RP70R:6;
    };
    struct {
      uint16_t RP69R0:1;
      uint16_t RP69R1:1;
      uint16_t RP69R2:1;
      uint16_t RP69R3:1;
      uint16_t RP69R4:1;
      uint16_t RP69R5:1;
      uint16_t :2;
      uint16_t RP70R0:1;
      uint16_t RP70R1:1;
      uint16_t RP70R2:1;
      uint16_t RP70R3:1;
      uint16_t RP70R4:1;
      uint16_t RP70R5:1;
    };
  };
} RPOR8BITS;
extern volatile RPOR8BITS RPOR8bits __attribute__((__sfr__));

#define RPOR9 RPOR9
extern volatile uint16_t RPOR9 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR9BITS {
  union {
    struct {
      uint16_t RP97R:6;
      uint16_t :2;
      uint16_t RP118R:6;
    };
    struct {
      uint16_t RP97R0:1;
      uint16_t RP97R1:1;
      uint16_t RP97R2:1;
      uint16_t RP97R3:1;
      uint16_t RP97R4:1;
      uint16_t RP97R5:1;
      uint16_t :2;
      uint16_t RP118R0:1;
      uint16_t RP118R1:1;
      uint16_t RP118R2:1;
      uint16_t RP118R3:1;
      uint16_t RP118R4:1;
      uint16_t RP118R5:1;
    };
  };
} RPOR9BITS;
extern volatile RPOR9BITS RPOR9bits __attribute__((__sfr__));

#define RPOR10 RPOR10
extern volatile uint16_t RPOR10 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR10BITS {
  union {
    struct {
      uint16_t RP120R:6;
      uint16_t :2;
      uint16_t RP176R:6;
    };
    struct {
      uint16_t RP120R0:1;
      uint16_t RP120R1:1;
      uint16_t RP120R2:1;
      uint16_t RP120R3:1;
      uint16_t RP120R4:1;
      uint16_t RP120R5:1;
      uint16_t :2;
      uint16_t RP176R0:1;
      uint16_t RP176R1:1;
      uint16_t RP176R2:1;
      uint16_t RP176R3:1;
      uint16_t RP176R4:1;
      uint16_t RP176R5:1;
    };
  };
} RPOR10BITS;
extern volatile RPOR10BITS RPOR10bits __attribute__((__sfr__));

#define RPOR11 RPOR11
extern volatile uint16_t RPOR11 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR11BITS {
  union {
    struct {
      uint16_t RP177R:6;
      uint16_t :2;
      uint16_t RP178R:6;
    };
    struct {
      uint16_t RP177R0:1;
      uint16_t RP177R1:1;
      uint16_t RP177R2:1;
      uint16_t RP177R3:1;
      uint16_t RP177R4:1;
      uint16_t RP177R5:1;
      uint16_t :2;
      uint16_t RP178R0:1;
      uint16_t RP178R1:1;
      uint16_t RP178R2:1;
      uint16_t RP178R3:1;
      uint16_t RP178R4:1;
      uint16_t RP178R5:1;
    };
  };
} RPOR11BITS;
extern volatile RPOR11BITS RPOR11bits __attribute__((__sfr__));

#define RPOR12 RPOR12
extern volatile uint16_t RPOR12 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR12BITS {
  union {
    struct {
      uint16_t RP179R:6;
      uint16_t :2;
      uint16_t RP180R:6;
    };
    struct {
      uint16_t RP179R0:1;
      uint16_t RP179R1:1;
      uint16_t RP179R2:1;
      uint16_t RP179R3:1;
      uint16_t RP179R4:1;
      uint16_t RP179R5:1;
      uint16_t :2;
      uint16_t RP180R0:1;
      uint16_t RP180R1:1;
      uint16_t RP180R2:1;
      uint16_t RP180R3:1;
      uint16_t RP180R4:1;
      uint16_t RP180R5:1;
    };
  };
} RPOR12BITS;
