MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV256GM006/mcu.h
#define _IPC24_PWM4IP2_POSITION                  0x00000006
#define _IPC24_PWM4IP2_MASK                      0x00000040
#define _IPC24_PWM4IP2_LENGTH                    0x00000001

#define _IPC24_PWM5IP0_POSITION                  0x00000008
#define _IPC24_PWM5IP0_MASK                      0x00000100
#define _IPC24_PWM5IP0_LENGTH                    0x00000001

#define _IPC24_PWM5IP1_POSITION                  0x00000009
#define _IPC24_PWM5IP1_MASK                      0x00000200
#define _IPC24_PWM5IP1_LENGTH                    0x00000001

#define _IPC24_PWM5IP2_POSITION                  0x0000000A
#define _IPC24_PWM5IP2_MASK                      0x00000400
#define _IPC24_PWM5IP2_LENGTH                    0x00000001

#define _IPC24_PWM6IP0_POSITION                  0x0000000C
#define _IPC24_PWM6IP0_MASK                      0x00001000
#define _IPC24_PWM6IP0_LENGTH                    0x00000001

#define _IPC24_PWM6IP1_POSITION                  0x0000000D
#define _IPC24_PWM6IP1_MASK                      0x00002000
#define _IPC24_PWM6IP1_LENGTH                    0x00000001

#define _IPC24_PWM6IP2_POSITION                  0x0000000E
#define _IPC24_PWM6IP2_MASK                      0x00004000
#define _IPC24_PWM6IP2_LENGTH                    0x00000001

#define _IPC35_ICDIP_POSITION                    0x00000008
#define _IPC35_ICDIP_MASK                        0x00000700
#define _IPC35_ICDIP_LENGTH                      0x00000003

#define _IPC35_OC16IP0_POSITION                  0x00000000
#define _IPC35_OC16IP0_MASK                      0x00000001
#define _IPC35_OC16IP0_LENGTH                    0x00000001

#define _IPC35_OC16IP1_POSITION                  0x00000001
#define _IPC35_OC16IP1_MASK                      0x00000002
#define _IPC35_OC16IP1_LENGTH                    0x00000001

#define _IPC35_OC16IP2_POSITION                  0x00000002
#define _IPC35_OC16IP2_MASK                      0x00000004
#define _IPC35_OC16IP2_LENGTH                    0x00000001

#define _IPC35_IC16IP0_POSITION                  0x00000004
#define _IPC35_IC16IP0_MASK                      0x00000010
#define _IPC35_IC16IP0_LENGTH                    0x00000001

#define _IPC35_IC16IP1_POSITION                  0x00000005
#define _IPC35_IC16IP1_MASK                      0x00000020
#define _IPC35_IC16IP1_LENGTH                    0x00000001

#define _IPC35_IC16IP2_POSITION                  0x00000006
#define _IPC35_IC16IP2_MASK                      0x00000040
#define _IPC35_IC16IP2_LENGTH                    0x00000001

#define _IPC35_ICDIP0_POSITION                   0x00000008
#define _IPC35_ICDIP0_MASK                       0x00000100
#define _IPC35_ICDIP0_LENGTH                     0x00000001

#define _IPC35_ICDIP1_POSITION                   0x00000009
#define _IPC35_ICDIP1_MASK                       0x00000200
#define _IPC35_ICDIP1_LENGTH                     0x00000001

#define _IPC35_ICDIP2_POSITION                   0x0000000A
#define _IPC35_ICDIP2_MASK                       0x00000400
#define _IPC35_ICDIP2_LENGTH                     0x00000001

#define _IPC43_I2C1BCIP_POSITION                 0x00000004
#define _IPC43_I2C1BCIP_MASK                     0x00000070
#define _IPC43_I2C1BCIP_LENGTH                   0x00000003

#define _IPC43_I2C1BCIP0_POSITION                0x00000004
#define _IPC43_I2C1BCIP0_MASK                    0x00000010
#define _IPC43_I2C1BCIP0_LENGTH                  0x00000001

#define _IPC43_I2C1BCIP1_POSITION                0x00000005
#define _IPC43_I2C1BCIP1_MASK                    0x00000020
#define _IPC43_I2C1BCIP1_LENGTH                  0x00000001

#define _IPC43_I2C1BCIP2_POSITION                0x00000006
#define _IPC43_I2C1BCIP2_MASK                    0x00000040
#define _IPC43_I2C1BCIP2_LENGTH                  0x00000001

#define _IPC45_SENT1EIP_POSITION                 0x00000008
#define _IPC45_SENT1EIP_MASK                     0x00000700
#define _IPC45_SENT1EIP_LENGTH                   0x00000003

#define _IPC45_SENT1IP_POSITION                  0x0000000C
#define _IPC45_SENT1IP_MASK                      0x00007000
#define _IPC45_SENT1IP_LENGTH                    0x00000003

#define _IPC45_SENT1EIP0_POSITION                0x00000008
#define _IPC45_SENT1EIP0_MASK                    0x00000100
#define _IPC45_SENT1EIP0_LENGTH                  0x00000001

#define _IPC45_SENT1EIP1_POSITION                0x00000009
#define _IPC45_SENT1EIP1_MASK                    0x00000200
#define _IPC45_SENT1EIP1_LENGTH                  0x00000001

#define _IPC45_SENT1EIP2_POSITION                0x0000000A
#define _IPC45_SENT1EIP2_MASK                    0x00000400
#define _IPC45_SENT1EIP2_LENGTH                  0x00000001

#define _IPC45_SENT1IP0_POSITION                 0x0000000C
#define _IPC45_SENT1IP0_MASK                     0x00001000
#define _IPC45_SENT1IP0_LENGTH                   0x00000001

#define _IPC45_SENT1IP1_POSITION                 0x0000000D
#define _IPC45_SENT1IP1_MASK                     0x00002000
#define _IPC45_SENT1IP1_LENGTH                   0x00000001

#define _IPC45_SENT1IP2_POSITION                 0x0000000E
#define _IPC45_SENT1IP2_MASK                     0x00004000
#define _IPC45_SENT1IP2_LENGTH                   0x00000001

#define _IPC46_SENT2EIP_POSITION                 0x00000000
#define _IPC46_SENT2EIP_MASK                     0x00000007
#define _IPC46_SENT2EIP_LENGTH                   0x00000003

#define _IPC46_SENT2IP_POSITION                  0x00000004
#define _IPC46_SENT2IP_MASK                      0x00000070
#define _IPC46_SENT2IP_LENGTH                    0x00000003

#define _IPC46_ECCSBEIP_POSITION                 0x00000008
#define _IPC46_ECCSBEIP_MASK                     0x00000700
#define _IPC46_ECCSBEIP_LENGTH                   0x00000003

#define _IPC46_SENT2EIP0_POSITION                0x00000000
#define _IPC46_SENT2EIP0_MASK                    0x00000001
#define _IPC46_SENT2EIP0_LENGTH                  0x00000001

#define _IPC46_SENT2EIP1_POSITION                0x00000001
#define _IPC46_SENT2EIP1_MASK                    0x00000002
#define _IPC46_SENT2EIP1_LENGTH                  0x00000001

